zhanghjoy/SmartCar_GD/code_src/01_stm32_main_code.c
#include "stm32f10x.h"// Device header
#include "Delay.h"	//延时函数模块
#include "OLED.h"//OLED显示模块
#include "Motor.h"//电机模块
#include "Car_Action.h"//小车运动模块
#include "HCSR04.h"//超声波模块
#include "Beep.h"//蜂鸣器模块
#include "UART.h"//串口通信模块
#include "string.h"//字符串头文件
//状态标志位
u8 Car_State	=0;//蓝牙控制状态标志位
u8 HCSR_State	=0;//超声波避障状态标志位
u8 OpenMV_State=0;//OpenMV状态标志位
u8 Distate=0;//距离状态标志位
//变量初始化
float Dis      = 0;//超声波测得距离值
int   SRDis_TH = 30;//超声波避障距离阈值
int   PWML     = 0;//左电机的PWM值
int   PWMR     = 0;//右电机的PWM值

int main(void)
{
	OLED_Init();//OLED初始化
	UART1_Init();//串口1初始化
	UART2_Init();//串口二初始化
	MotorAll_Init();//电机初始化
	Beep_Init();//蜂鸣器初始化
	//OLED显示超声波距离字符串
	OLED_ShowString(1, 1, "SRDis:");
	OLED_ShowString(1, 10, ".");
	OLED_ShowString(1, 13, "cm");
	while(1)
	{
		PWML=PWM_RxPacket[0];//PI控制左电机的PWM值
		PWMR=PWM_RxPacket[1];//PI控制右电机PWM
		Show_SRDis();//超声波获取当前距离
		Dis=Get_DisVal();//获取当前超声波测得距离

		if(Dis > SRDis_TH)//距离大于阈值 
		{
			Distate = 0; //状态标志位置0
			Beep_Off();//不报警
		}
		if(Dis<SRDis_TH)//距离小于阈值 
		{
			Distate=1; //状态标志位置1
			Beep_Warning();//报警
		}
		//模式判断 是否超声波避障模式
		//超声波避障模式且距离大于阈值
		if (HCSR_State==1&&Distate==0 )
		{
				Car_Up();//小车前进	
		}
		//超声波避障模式且距离小于阈值
		if(HCSR_State==1&&Distate==1)
			{
					Car_Stop();//停车
					Delay_ms(200);
					Car_TurnLeft();//左转
					Delay_ms(500);
					Car_Stop();//停车
					Delay_ms(500);
		}
		//判断OpenMV是否回传了PWM值
		if(OpenMV_State==1)//当OpenMV回传PWM值
		{
			if(PWML<=100)//0到100为正转
			{
				MotorL_SetSpeed(PWML);
			}
			else //大于100为反转
			{
				MotorL_SetSpeed(-(PWML-100));
			}
			if(PWMR<=100)
			{
				MotorR_SetSpeed(PWMR);
			}
			else 
			{
				MotorR_SetSpeed(-(PWMR-100));
			}
		}
/************串口USATR2接收信息*************/
		//串口USART2收到上位机命令
		if (UART2_RxFlag == 1)
		{
			OLED_ShowString(4, 1, "                ");//清屏OLED第四行
			OLED_ShowString(4, 1, "RXCmd:");//显示RXCmd字符串
			OLED_ShowString(4, 7, UART2_RxPacket);//显示收到的命令			
			//TRAK 循迹模式
			if (strcmp(UART2_RxPacket, "TRAK") == 0  )
			{
				UART1_SendString("1");//用USART向OpenMV发送1选择循迹程序
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Tracking Mode");
				OpenMV_State=1;//OpenMV状态置1
			}
			//TROB循迹避障模式
			else if (strcmp(UART2_RxPacket, "TROB") == 0 )//选择循迹避障模式
			{
				int counter=0;
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "TRA&OBS Mode");
				OpenMV_State=1;//OpenMV状态为1
				if (Dis<SRDis_TH)//当距离小于阈值
				{
					Car_Stop();//停车
					Beep_Warning();//报警
					UART1_SendString("0");//向OpenMV模块发送0 选择默认模式
				}
				if(Dis>SRDis_TH)//如果距离大于阈值
				{
					counter+=1;
					if(counter>10)//计数滤波 判断10次以为真
					{
							Beep_Off();
							UART1_SendString("3");//向OpenMV发送3 进入循迹避障模式
					}
				}
			}
			//OBST避障模式
			else if (strcmp(UART2_RxPacket, "OBST") == 0)
			{
				UART1_SendString("2");//OpenMV通信2
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Obstacle Mode");
				OpenMV_State=2;//OpenMV状态置2
			}
			//HSLT水平舵机左转
			else if (strcmp(UART2_RxPacket, "HSLT") == 0)
			{
				UART1_SendString("4");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Hor_Servo_Left++");
			}
			//HSRT水平舵机右转
			else if (strcmp(UART2_RxPacket, "HSRT") == 0)
			{
				UART1_SendString("5");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Hor_Servo_Left--");
			}
			//VSUP垂直舵机向上
			else if (strcmp(UART2_RxPacket, "VSUP") == 0)//
			{
				UART1_SendString("6");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Ver_Servo_Up++");
			}
			//VSDW垂直舵机向下
			else if (strcmp(UART2_RxPacket, "VSDW") == 0)
			{
				UART1_SendString("7");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Ver_Servo_Down--");
			}
			//ATHP增大循迹角度阈值
			else if (strcmp(UART2_RxPacket, "ATHP") == 0)
			{
				UART1_SendString("8");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Angle_TH_Up");
			}
			//ATHD减小角度阈值
			else if (strcmp(UART2_RxPacket, "ATHD") == 0)
			{
				UART1_SendString("9");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Angle_TH_Down");
			}
			//DTHP 增加距离阈值
			else if (strcmp(UART2_RxPacket, "DTHP") == 0)
			{
				UART1_SendString("10");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Dis_TH_Up");
			}
			//DTHD减小距离阈值
			else if (strcmp(UART2_RxPacket, "DTHD") == 0)
			{
				UART1_SendString("11");
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Dis_TH_Down");
			}		
			//OFFSOpenMV回到默认状态0且停车
			else if(strcmp(UART2_RxPacket, "OFFS") == 0)
			{
				UART1_SendString("0");
				OpenMV_State=0;
				Car_Stop();//停车
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "OpenMV No Mode");
			}
			//BTCO选择遥控控制模式
			else if(strcmp(UART2_RxPacket, "BTCO") == 0)
			{
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "BlueTooth Mode");
				OLED_ShowString(3, 1, "Car State:");
				Car_State=1;//小车状态置1 蓝牙遥控模式
				OLED_ShowNum(3, 11, Car_State, 1);
			}
			//OFFB关闭蓝牙遥控模式
			else if(strcmp(UART2_RxPacket, "OFFB") == 0)
			{
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "BlueTooth  OFF");
				OLED_ShowString(3, 1, "Car State:");
				Car_State=0;//小车状态置0
				OLED_ShowNum(3, 11, Car_State, 1);
			}
			//蓝牙模式下 UPUP小车前进
			else if(strcmp(UART2_RxPacket, "UPUP") == 0 && (Car_State==1))
			{
				OLED_ShowString(2, 1, "BTCmd:");
				OLED_ShowString(3, 1, "Car State:");
				OLED_ShowNum(3, 11, Car_State, 1);
				OLED_ShowString(2, 7, "UpUp");
				Car_Up();
			}
			//蓝牙模式下 DOWN小车后退
			else if(strcmp(UART2_RxPacket, "DOWN") == 0 && (Car_State==1))
			{
				OLED_ShowString(2, 7, "Down");
				Car_Down();
			}
			//蓝牙模式下 RIGH小车右转
			else if(strcmp(UART2_RxPacket, "RIGH") == 0 && (Car_State==1))
			{
				OLED_ShowString(2, 7, "Trun Right");
				Car_TurnRight();
			}
			//蓝牙模式下 LEFT小车左转
			else if(strcmp(UART2_RxPacket, "LEFT") == 0 && (Car_State==1))
			{
				OLED_ShowString(2, 7, "Trun Left");
				Car_TurnLeft();
			}
			//蓝牙模式下 SPIN小车旋转
			else if(strcmp(UART2_RxPacket, "SPIN") == 0 && (Car_State==1))
			{
				OLED_ShowString(2, 7, "Spin");
				Car_Spin();
			}
			//蓝牙模式下 STOP停车
			else if(strcmp(UART2_RxPacket, "STOP") == 0 && (Car_State==1))
			{
				OLED_ShowString(2, 7, "Stop");
				Car_Stop();
			}

			//SROB 进入超声波避障模式
			else if(strcmp(UART2_RxPacket, "SROB") == 0 )
			{
				HCSR_State=1;
				OLED_ShowString(2, 7, "SR OBS");
			}
			//OFFR停止退出超声波避障
			else if(strcmp(UART2_RxPacket, "OFFR") == 0 )
			{
				OLED_ShowString(2, 7, "Stop SR");
				HCSR_State=0;//避障标志位清0
				Car_Stop();
			}	
			//DWPV减小PID控制的P值
			else if(strcmp(UART2_RxPacket, "DWPV") == 0 )
			{
				UART1_SendString("12");
			}
			//UPPV增加PID控制P值
			else if(strcmp(UART2_RxPacket, "UPPV") == 0 )
			{
				UART1_SendString("13");
			}	
			//UPIV增加PID控制I值	
			else if(strcmp(UART2_RxPacket, "UPIV") == 0 )
			{
				UART1_SendString("14");
			}		
			//DWIV减小PID控制的I值
			else if(strcmp(UART2_RxPacket, "DWIV") == 0 )
			{
				UART1_SendString("15");
			}		
			else //没有收到软件指令 等待命令
			{
				OLED_ShowString(2, 1, "                ");
				OLED_ShowString(2, 1, "Wait Right Cmd");
			}
			UART2_RxFlag = 0;//串口二标志位更新
		}
/************串口USATR1接收信息*************/
		if (UART1_RxFlag == 1)//如果收到OpenMv发来的命令
		{
			//OMV1 小车直行
			if (strcmp(UART1_RxPacket, "OMV1") == 0  )
			{
					Car_Up();
			}
			//OMV2小车左转
			else if (strcmp(UART1_RxPacket, "OMV2") == 0  )
			{
					Car_TurnLeft();
			}  
			//OMV3小车右转                               
			else if (strcmp(UART1_RxPacket, "OMV3") == 0  )
			{
					Car_TurnRight();
			}
			//OMV4停车        
			else if (strcmp(UART1_RxPacket, "OMV4") == 0  )
			{
					Car_Stop();
			}
			UART1_RxFlag = 0;//串口USART1标志位更新
		}
	}
}

/*************************Delay延时模块*******************************
模块功能：产生X (us ms s)延时效果
*********************************************************************/
#include "stm32f10x.h"
//0到233015微妙延时
void Delay_us(uint32_t xus)
{
	SysTick->LOAD = 72 * xus;			//设置定时器重装值ARR=72x
	SysTick->VAL = 0x00;					//清空当前计数值
	SysTick->CTRL = 0x00000005;	//设置时钟源为HCLK 启动定时器
	while(!(SysTick->CTRL & 0x00010000));//等待计数到0
	SysTick->CTRL = 0x00000004;		//关闭定时器
}

//函数功能：0~4294967295毫秒延时
void Delay_ms(uint32_t xms)
{
	while(xms--)
	{
		Delay_us(1000);
	}
}

 //0~4294967295秒级延时
void Delay_s(uint32_t xs)
{
	while(xs--)
	{
		Delay_ms(1000);
	}
} 
/********************Timer定时器模块*******************************
用于定时器TIM2 TIM3初始化 以及PWM值的设定
TIM2用于超声波测距 TIM用于PWM电机控制
*********************************************************************/
#include "stm32f10x.h"//头文件

//初始化定时器TIM3 并配置PWM初始化参数
void PWM12_Init(void)
{	//开启TIM3和GPIOA的时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	//初始化GPIO口 PA6 PA7 用于产生PWM信号
	GPIO_InitTypeDef GPIO_InitStructure;
	//复用推挽输出模式因为复用了TIM3外设
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6|GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化GPIO A6 A7 
	//使用内部时钟
	TIM_InternalClockConfig(TIM3);
	//配置时基单元参数
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;//定时器不分频
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;//向上计数模式
	TIM_TimeBaseInitStructure.TIM_Period = 100 - 1;//ARR自动重装值
	TIM_TimeBaseInitStructure.TIM_Prescaler = 36 - 1;//PSC预分频值
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;//到达ARR触发一次中断 停止计数
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);//初始化单元
	//输出比较结构体配置
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);//补全结构体中未配置参数
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Reset;	
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;//选择PWM模式1
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;//输出比较极性选择
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;//输出使能

