zhanghjoy/SmartCar_GD/code_src/01_stm32_main_code.c
	TIM_OC1Init(TIM3, &TIM_OCInitStructure);//初始化 TIM3 OC1
	TIM_OC1PreloadConfig(TIM3,TIM_OCPreload_Enable);//使能CCR1自动重装
	TIM_OC2Init(TIM3, &TIM_OCInitStructure);//初始化 TIM3 OC2	
	TIM_OC2PreloadConfig(TIM3,TIM_OCPreload_Enable);//使能CCR2自动重装
	
	TIM_ARRPreloadConfig(TIM3,ENABLE);//开启预装载
	TIM_Cmd(TIM3, ENABLE);//开启定时器3
	TIM3->CCR1 = 0;//设置输出比较值
	TIM3->CCR2 = 0;
}

//设置PWM1比较值 为Compare 即输出比较值
void PWM12_SetCompare1(uint16_t Compare)
{
	TIM_SetCompare1(TIM3, Compare);
}

//设置PWM2比较值 为Compare
void PWM12_SetCompare2(uint16_t Compare)
{
	TIM_SetCompare2(TIM3, Compare);
}

//超声波测距定时器TIM2 初始化
void Timer_Init(void)
{	//开启定时器时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	//使用内部时钟
	TIM_InternalClockConfig(TIM2);
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;//不分频
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;//向上计数
	TIM_TimeBaseInitStructure.TIM_Period = 65535;//ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler=72-1;//预分频值
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;//CNT到达ARR中断一次
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);
	TIM_SetCounter(TIM2,0);//CNT值清0
}

//开启TIM2定时器
void Timer_ON(void)
{
	TIM_Cmd(TIM2,ENABLE);
}

//关闭TIM2定时器
void Timer_OFF(void)
{
	TIM_Cmd(TIM2,DISABLE);
}

/******************************Motor电机模块**************************
电机初始化设置 以及电机PWM设置
*********************************************************************/
#include "stm32f10x.h"                  // Device header
#include "Timer.h"

void MotorAll_Init(void)
{
	//开启电机驱动口的四个GPIO
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;//推挽输出
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13|GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	PWM12_Init();//开启定时器
}

//设置右路电机速度 PWM
void MotorR_SetSpeed(int8_t Speed)
{
	if (Speed >= 0)//Speed值为正
	{
		GPIO_SetBits(GPIOB, GPIO_Pin_12);//电机正转
		GPIO_ResetBits(GPIOB, GPIO_Pin_13);
		PWM12_SetCompare1(Speed);//设置Speed转速
	}
	else//Speed值为负
	{
		GPIO_ResetBits(GPIOB, GPIO_Pin_12);//电机反转
		GPIO_SetBits(GPIOB, GPIO_Pin_13);
		PWM12_SetCompare1(-Speed);//设为-Speed转速
	}
}

//设置左路电机PWM 速度
void MotorL_SetSpeed(int8_t Speed)
{
	if (Speed >= 0)
	{
		GPIO_SetBits(GPIOB, GPIO_Pin_14);
		GPIO_ResetBits(GPIOB, GPIO_Pin_15);
		PWM12_SetCompare2(Speed);
	}
	else
	{
		GPIO_ResetBits(GPIOB, GPIO_Pin_14);
		GPIO_SetBits(GPIOB, GPIO_Pin_15);
		PWM12_SetCompare2(-Speed);
	}
}
/******************************模块简介*******************************
模块功能：小车运动 模块函数封装 
*********************************************************************/
#include "stm32f10x.h"                  // Device header
#include "Motor.h" 
#include "Delay.h"  
void Car_Stop()//小车停止
{
	MotorR_SetSpeed(0);
	MotorL_SetSpeed(0);
}

void Car_Up()//小车前进
{
	MotorR_SetSpeed(40);
	MotorL_SetSpeed(40);	
}

void Car_Down()//小车后退
{
	MotorR_SetSpeed(-40);
	MotorL_SetSpeed(-40);
}

void Car_TurnRight()//小车右转
{
	MotorR_SetSpeed(-45);
	MotorL_SetSpeed(35);
}

void Car_TurnLeft()//小车左转
{
	MotorR_SetSpeed(35);
	MotorL_SetSpeed(-45);
}

void Car_Spin()//小车旋转
{
	MotorR_SetSpeed(40);
	MotorL_SetSpeed(-50);
}
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "Timer.H"
#include "OLED.h"
//参数初始化
float Num;
int i=0,Counter,Sum,Dec,CNT_Mean,CN1,CN2;
//超声波模块触发函数
void SR04_Start(void)
{
	GPIO_SetBits(GPIOA,GPIO_Pin_0);//A0置1大于10us
	Delay_us(15);
	GPIO_ResetBits(GPIOA,GPIO_Pin_0);
}

void SR04_Init(void)
{
	Timer_Init();//开启定时器3
	GPIO_InitTypeDef GPIO_InitStructure;//定义初始化结构体
	EXTI_InitTypeDef EXTI_InitStructure;//定义外部中断结构体
	NVIC_InitTypeDef NVIC_InitStructure;//定义NVIC结构体
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);//开GPIO时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);//开AFIO时钟
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOA,GPIO_PinSource1);
	EXTI_InitStructure.EXTI_Line=EXTI_Line1;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;	
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);
	NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; 
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;	
	NVIC_Init(&NVIC_InitStructure);
	//脉冲触发端口 Trig=PA0
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	//回波接收端口 Echo=PA1
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	SR04_Start();
}
void EXTI1_IRQHandler(void)
{
	Delay_us(50);
	if(EXTI_GetITStatus(EXTI_Line1) != RESET)
	{	
		Timer_ON();//开始计时
		CN1 = TIM_GetCounter(TIM2);
		while(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_1));//A1为高电平时一直循环下去
		CN2 = TIM_GetCounter(TIM2);
		Counter = CN2 - CN1;//获得计数差
		EXTI_ClearITPendingBit(EXTI_Line1);//清除标志位
	}
}
                         
void Show_SRDis(void)
{
	for(i=0;i<5;i++)//均值滤波
	{
		SR04_Init();
		Sum+=Counter;
	}
	CNT_Mean=Sum/5;
	Num=CNT_Mean*0.017;//b/5 * 17/1000
	Dec=(17*Sum/5)%100;//100取余得到小数点后值
	OLED_ShowNum(1,7,Num,3);
	OLED_ShowNum(1,11,Dec,2);
	Delay_ms(100);
	Sum=0;//更新Sum
}

//返回超声波测距值
float Get_DisVal(void)
{
	return Num;
}
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
void Beep_Init(void)
{	//开启时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	//PB10 GPIO结构体初始化
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;//推挽输出模式
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
}
	
void Beep_On(void)//开启蜂鸣器
{
	GPIO_ResetBits(GPIOB, GPIO_Pin_10);
}

void Beep_Off(void)//关闭蜂鸣器
{
	GPIO_SetBits(GPIOB, GPIO_Pin_10);
}

void Beep_Warning(void)//蜂鸣器报警
{
	Beep_On();
	Delay_ms(500);
	Beep_Off();
	Delay_ms(500);	
}
/******************************UART串口通信模块***********************
串口一和二的初始化函数封装 串口一和二中断语句句柄 以及串口一发送函数
*********************************************************************/
#include "stm32f10x.h"                // Device header
//char用于接收字符 接收缓存区
char UART1_RxPacket[100];//存放小车运动命令	
char UART2_RxPacket[100];//存放APP的控制命令
char PWM_RxPacket[100];//存放PWM值
uint8_t UART1_RxFlag;//串口一是否收到数据标志位
uint8_t UART2_RxFlag;//串口二是否收到数据标志位
static int PWML=0,PWMR=0;

//串口USART1的初始化
void UART1_Init(void)
{
	//开启UART时钟和GPIO时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	//将PA9配置为复用推挽输出 供USART1的TX输出信号使用
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	//将PA10配置为上拉输入 供USART1的RX接收信号使用
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;//上拉输入
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	//配置UART参数
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = 115200;//波特率9600
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//硬件流控不使用流控
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;//既要发送又要接收
	USART_InitStructure.USART_Parity = USART_Parity_No;//无校验位
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//选择一位停止位
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//无校验为选择8位字长
	USART_Init(USART1, &USART_InitStructure);//UART1结构体初始化
	//中断配置
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);//中断线
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//中断分组
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	USART_Cmd(USART1, ENABLE);//开启USART1
}

//串口USART2的初始化
void UART2_Init(void)
{
	//开启UART时钟和GPIO时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	//将PA2配置为复用推挽输出 供USART2的TX输出信号使用
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	//将P3配置为上拉输入 供USART2的RX接收信号使用
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;//上拉输入
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	//配置UART参数
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = 9600;//波特率9600
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//硬件流控不使用流控
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;//只接收
	USART_InitStructure.USART_Parity = USART_Parity_No;//无校验位
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//选择一位停止位
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//无校验为选择8位字长
	USART_Init(USART2, &USART_InitStructure);//UART1结构体初始化
	//中断配置
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);//中断线
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//中断分组
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	//串口二通信中断等级高
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStructure);
	USART_Cmd(USART2, ENABLE);//开启USART2
}

