zhanghjoy/SmartCar_GD/code_src/01_stm32_main_code.c
//USART1中断函数执行句柄
void USART1_IRQHandler(void)
{
	static uint8_t RxState1 = 0;//状态变量S
	static uint8_t RxState3 = 0;//PWM值状态变量S
	static uint8_t pRxPacket1= 0;//指示接收到哪一个数据了
	static uint8_t pRxPacket3= 0;//PWM值接收到哪一个数据了
	if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)//判断RXNE标志位是否置一
	{
		uint8_t RxData1 = USART_ReceiveData(USART1);//定义RxData同时赋值 接收数据
		//接收PWM值
		if (RxState3 == 0)
		{
			if(RxData1=='P')//PWM包头一判断
			{
				RxState3 = 1;
				pRxPacket3 = 0;
			}
		}
		else if (RxState3 == 1)
		{
			if(RxData1=='W')//PWM包头二判断
			{
				RxState3 = 2;
				pRxPacket3 = 0;
			}
		}
		else if (RxState3 == 2)
		{
			if(RxData1=='M')//PWM包头三判断
			{
				RxState3 = 3;
				pRxPacket3 = 0;
			}
		}
		else if (RxState3 == 3)
		{
			if (RxData1 == '$')//判断是不是第一个包尾
			{
				RxState3 = 4;//是则跳转到状态4
			}
			else//不是包尾才接收数据
			{
				PWM_RxPacket[pRxPacket3] = RxData1;
				pRxPacket3 ++;
			}
		}
		else if (RxState3 == 4)
		{
			if (RxData1 == '#')//判断是否是第二个包尾
			{
				RxState3 = 0;
				PWM_RxPacket[pRxPacket3] = '\0';//加一个字符串结束标志位确定字符串的长度
				UART1_RxFlag = 1;//表示接收完成
			}
		}
		//接收小车运动控制命令
		if (RxState1 == 0)
		{
			if (RxData1 == '$' && UART1_RxFlag == 0)//防止发的太快还没处理完
			{
				RxState1 = 1;
				pRxPacket1 = 0;
			}
		}
		else if (RxState1 == 1)
		{
			if (RxData1 == '&')//判断是不是第一个包尾
			{
				RxState1 = 2;//是则跳转到状态2
			}
			else//不是包尾才接收数据
			{
				UART1_RxPacket[pRxPacket1] = RxData1;
				pRxPacket1 ++;
			}
		}
		else if (RxState1 == 2)
		{
			if (RxData1 == '#')//判断是否是第二个包尾
			{
				RxState1 = 0;
				UART1_RxPacket[pRxPacket1] = '\0';//加一个字符串结束标志位确定字符串的长度
				UART1_RxFlag = 1;//表示接收完成
			}
		}

		USART_ClearITPendingBit(USART1, USART_IT_RXNE);//清除标志位
	}
}

//USART2中断函数执行句柄
void USART2_IRQHandler(void)
{
	static uint8_t RxState2= 0;//状态变量S
	static uint8_t pRxPacket2 = 0;//指示接收到哪一个数据了
	if (USART_GetITStatus(USART2, USART_IT_RXNE) == SET)//判断RXNE标志位是否置一
	{
		uint8_t RxData2 = USART_ReceiveData(USART2);//定义RxData同时赋值
		//接收蓝牙APP指令
		if (RxState2 == 0)
		{
			if (RxData2 == '%' && UART2_RxFlag == 0)//防止发的太快还没处理完
			{
				RxState2 = 1;
				pRxPacket2 = 0;
			}
		}
		else if (RxState2 == 1)
		{
			if (RxData2 == '@')//判断是不是第一个包尾
			{
				RxState2 = 2;//是则跳转到状态2
			}
			else//不是包尾才接收数据
			{
				UART2_RxPacket[pRxPacket2] = RxData2;
				pRxPacket2 ++;
			}
		}
		else if (RxState2 == 2)
		{
			if (RxData2 == '?')//判断是否是第二个包尾
			{
				RxState2 = 0;
				UART2_RxPacket[pRxPacket2] = '\0';//加一个字符串结束标志位确定字符串的长度
				UART2_RxFlag = 1;//表示接收完成
			}
		}
		
		USART_ClearITPendingBit(USART2, USART_IT_RXNE);//清除标志位
	}
}

void UART1_SendByte(uint8_t Byte)//发送一个8字节的变量
{
	USART_SendData(USART1, Byte);
	while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);//等待发送寄存器空标志位置1
}

void UART1_SendString(char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i ++)
	{
		UART1_SendByte(String[i]);
	}
}
/*************************OLED显示模块*******************************
封装了控制OLED显示字符和数字的函数
*********************************************************************/
#include "stm32f10x.h"
#include "OLED_Font.h"//OLED字模库
//宏定义
#define OLED_W_SCL(x)		GPIO_WriteBit(GPIOB, GPIO_Pin_8, (BitAction)(x))
#define OLED_W_SDA(x)		GPIO_WriteBit(GPIOB, GPIO_Pin_9, (BitAction)(x))
//端口初始化
void OLED_I2C_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;//开漏输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	OLED_W_SCL(1);//SCL写1
	OLED_W_SDA(1);//SDA写1
}

//I2C起始帧
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);//SDA先从1->0
	OLED_W_SCL(1);
	OLED_W_SDA(0);
	OLED_W_SCL(0);
}

//IIC停止帧
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);//SCL先从0->1
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

//IICf发送一个Byte
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i++)
	{
		OLED_W_SDA(Byte & (0x80 >> i));
		OLED_W_SCL(1);
		OLED_W_SCL(0);
	}
	OLED_W_SCL(1);	//额外的一个时钟 不处理应答信号
	OLED_W_SCL(0);
}

//OLED写命令
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		//从机地址
	OLED_I2C_SendByte(0x00);		//写命令
	OLED_I2C_SendByte(Command); 
	OLED_I2C_Stop();
}

//OLED写数据
void OLED_WriteData(uint8_t Data)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		//从机地址
	OLED_I2C_SendByte(0x40);		//写数据
	OLED_I2C_SendByte(Data);
	OLED_I2C_Stop();
}

//OLED光标位置 X (0-127) Y(0-7)
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
	OLED_WriteCommand(0xB0 | Y);					//设置Y位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//设置X位置高4位
	OLED_WriteCommand(0x00 | (X & 0x0F));			//设置X位置低4位
}

//OLED清屏
void OLED_Clear(void)
{  
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor(j, 0);
		for(i = 0; i < 128; i++)
		{
			OLED_WriteData(0x00);
		}
	}
}

//OLED显示字符 4行16列
void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char)
{      	
	uint8_t i;
	OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8);		//设置光标位置在上半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i]);			//显示上半部分内容
	}
	OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8);	//设置光标位置在下半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i + 8]);		//显示下半部分内容
	}
}

//OLED显示字符串 4行16列
void OLED_ShowString(uint8_t Line, uint8_t Column, char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar(Line, Column + i, String[i]);
	}
}

//返回X的Y次方
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y--)
	{
		Result *= X;
	}
	return Result;
}

//显示十进制正数 4行16列 最大10位
void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

//OLED初始化
void OLED_Init(void)
{
	uint32_t i, j;

	for (i = 0; i < 1000; i++)			//上电延时
	{
		for (j = 0; j < 1000; j++);
	}
	OLED_I2C_Init();			//端口初始化
	OLED_WriteCommand(0xAE);	//关闭显示
	OLED_WriteCommand(0xD5);	//设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);
	OLED_WriteCommand(0xA8);	//设置多路复用率
	OLED_WriteCommand(0x3F);
	OLED_WriteCommand(0xD3);	//设置显示偏移
	OLED_WriteCommand(0x00);
	OLED_WriteCommand(0x40);	//设置显示开始行
	OLED_WriteCommand(0xA1);	//设置左右方向，0xA1正常 0xA0左右反置
	OLED_WriteCommand(0xC8);	//设置上下方向，0xC8正常 0xC0上下反置
	OLED_WriteCommand(0xDA);	//设置COM引脚硬件配置
	OLED_WriteCommand(0x12);
	OLED_WriteCommand(0x81);	//设置对比度控制
	OLED_WriteCommand(0xCF);
	OLED_WriteCommand(0xD9);	//设置预充电周期
	OLED_WriteCommand(0xF1);
	OLED_WriteCommand(0xDB);	//设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);
	OLED_WriteCommand(0xA4);	//设置整个显示打开/关闭
	OLED_WriteCommand(0xA6);	//设置正常/倒转显示
	OLED_WriteCommand(0x8D);	//设置充电泵
	OLED_WriteCommand(0x14);
	OLED_WriteCommand(0xAF);	//开启显示
	OLED_Clear();				//OLED清屏
}